Revit 2027 API
SpotDimension.LeaderHasShoulder Property
 True is dimension has leader with shoulder, false otherwise.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool LeaderHasShoulder { get; set; }
Public Property LeaderHasShoulder As Boolean
	Get
	Set
public:
property bool LeaderHasShoulder {
	bool get ();
	void set (bool value);
}
member LeaderHasShoulder : bool with get, set
Property Value
Boolean
Exceptions
Exception | Condition
InvalidOperationException |  Dimension must have leader. -or- Thrown when:
SpotDimension style type is SpotSlope.
Using equality formula.
Dimension style is ordinate.
 -or- The dimension is a SpotSlope or has no leader.
See Also
Reference
SpotDimension Class
Autodesk.Revit.DB Namespace